{
    "type": "AdaptiveCard",
    "version": "1.3",
    "body": [
        {
            "type": "TextBlock",
            "text": "Lodge a complaint",
            "wrap": true,
            "size": "large"
        },
        {
            "type": "TextBlock",
            "text": "Make a complaint to your employer, school or the relevant organisation (e.g. a service provider) and ask that they handle it in a fair and impartial manner. If needed, seek assistance from the EOC, social workers, trade unions, NGOs, your friends or family. ", 
            "isVisible": true,
            "wrap": true
        },
        {
            "type": "TextBlock",
            "text": "What are the benefits?",
            "isVisible": false,
            "id": "textToToggle2",
            "wrap": true
        },
        {
            "type": "TextBlock",
            "text": "- You may receive school accommodations like changes to your schedule, where you live, a leave of absence, or a no contact order to keep the offender away.\r - It might help prevent the same thing from happening to other students.\r - It creates a papertrail to show that you reported what happened (sometimes helpful in a future legal case).\r - If the school decides not to take action or doesn’t follow proper procedure, you have a right to file a grievance against the school.\r - Possible accommodation will help you access your right to education and will provide you time to heal without worrying about your performance at the school.\r - It is your right to cooperate with the investigation at school, in case you decide not to pursue any actions.",
            "isVisible": false,
            "id": "textToToggle3",
            "wrap": true
        },
        {
            "type": "TextBlock",
            "text": "What are the potential risks?",
            "isVisible": false,
            "id": "textToToggle4",
            "wrap": true
        },
        {
            "type": "TextBlock",
            "text": "- Title IX has a duty to both you and the offender (if they are also a student at your school).\r - Every school’s Title IX process is different - check with your school to learn more about what their process includes, and what standard of evidence they use.\r - Once you report, the process & outcome may be out of your control.",
            "isVisible": false,
            "id": "textToToggle5",
            "wrap": true
        }
    ],
    "actions": [
        {
            "type": "Action.ToggleVisibility",
            "title": "Toggle",
            "targetElements": [
                "textToToggle2",
                "textToToggle3",
                "textToToggle4",
                "textToToggle5"
            ]
        }
    ]
}